3B/SE464/04-Scalability.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-05 Thu 09:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Scalability</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Scalability</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb25b6f3">1. Scalability</a></li>
<li><a href="#org3a20de4">2. HTTP and Web Servers</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgb25b6f3" class="outline-2">
<h2 id="orgb25b6f3"><span class="section-number-2">1.</span> Scalability</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Service</b>: different from simple program since it listens for requests from
clients/users and may handle multiple requests concurrently
</p>

<p>
Requests usually delivered as messages that arrive over a network.
Service runs constantly, waiting for requests and processing them.
</p>

<p>
A service is scalable if it can easily handle growth in the number of
concurrent users/requests.
</p>

<p>
Measured through <b>work throughput</b>:
</p>
<ul class="org-ul">
<li>requests/queries per second</li>
<li>concurrent users</li>
<li>monthly active users</li>
</ul>

<p>
Ignore cost, just consider scale achieved.
</p>

<p>
Scaling challenges:
</p>
<ul class="org-ul">
<li>limited speed from one machine</li>
<li>coordinating multiple machines</li>
<li>sharing data among machines</li>
<li>failure probability</li>
<li>high latency from worldwide users</li>
<li>authentication of service components</li>
<li>software updates without downtime</li>
</ul>

<p>
<b>Vertical scaling</b>: make machine bigger and stronger
</p>

<p>
<b>Horizontal scaling</b>: add more machines
</p>

<p>
Computer performance affected by number/speed of CPU cores, RAM, disk type,
number of disks, type of network connectivity, GPUs, TPUs, etc.
</p>

<p>
<b>Shared Memory Parallelism</b>: a single process can have multiple threads which execute
concurrently while sharing the same memory
</p>

<p>
Cloud computing resources are elastic since size and quantity of resources
and can be quickly changed.
</p>

<p>
Vertical scaling is not scalable:
</p>
<ul class="org-ul">
<li>easy to write programs since most OSs have multithreading</li>
<li>less communication required with other machines</li>
<li>cannot handle big loads</li>
<li>cannot be scaled easily (must replace entire machine)</li>
<li>single point of failure</li>
<li>bad price/performance ratio</li>
</ul>
</div>
</div>
<div id="outline-container-org3a20de4" class="outline-2">
<h2 id="org3a20de4"><span class="section-number-2">2.</span> HTTP and Web Servers</h2>
<div class="outline-text-2" id="text-2">
<p>
To convert a program to a service:
</p>
<ol class="org-ol">
<li>listen to requests on the network</li>
<li>run many copies of program concurrently</li>
<li>use queues to store unhandled requests and unsent responses
<ol class="org-ol">
<li>allows competing threads to share single network socket</li>
</ol></li>
</ol>

<p>
With parallel threads, even if only a single CPU core, multiple threads can run
since the app may block to request data from disk or network (IO), and in the
same time, another thread can run.
</p>

<p>
<b>HTTP</b>: client-server data exchange protocol
</p>

<p>
<b>Request</b> specifies:
</p>
<ul class="org-ul">
<li>human readable header with URL, method, and more</li>
<li>optional body with raw data</li>
</ul>

<p>
<b>Response</b> includes:
</p>
<ul class="org-ul">
<li>human readable header with response code and more</li>
<li>optional body</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-05 Thu 09:49</p>
</div>
</body>
</html>
